	 
#Область ОбработчикиСобытийФормы
	 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьЭлементовПоТипуДействия();
	
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипДействияПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовПоТипуДействия();
	
КонецПроцедуры  

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура УстановитьВидимостьЭлементовПоТипуДействия()

	Элементы.Страницы.Видимость = ЗначениеЗаполнено(Объект.ТипДействия);
	
	Если Не Элементы.Страницы.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ТипДействия = Перечисления.TBM_ТипыДействийБотовTelegram.ОтправкаОтчета Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОтчеты;     
	ИначеЕсли Объект.ТипДействия = Перечисления.TBM_ТипыДействийБотовTelegram.МногоэтапноеДействие Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаМногоэтапноеДействие;
	ИначеЕсли Объект.ТипДействия = Перечисления.TBM_ТипыДействийБотовTelegram.Этап Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЭтап;
	ИначеЕсли Объект.ТипДействия = Перечисления.TBM_ТипыДействийБотовTelegram.ПроизвольноеДействие Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПроизвольныйКод; 
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

