
#Область ПрограммныйИнтерфейс

// Переопределяет параметры отправки печатных форм при подготовке письма.
// Может использоваться, например, для подготовки текста письма.
// 
// Параметры:
//  ПараметрыОтправки - Структура - Параметры отправки:
// * Получатель - Массив Из Строка 
// * Тема - Строка
// * Текст - Строка
// * Вложения - Структура:
//  ** АдресВоВременномХранилище - Строка
//  ** Представление - Строка
// ПараметрыВывода - Структура - Параметры вывода
// ОбъектыПечати - Массив Из ОбъектМетаданных - Объекты печати
// ПечатныеФормы - ТаблицаЗначений - Печатные формы:
//  * Название - Строка
//  * ТабличныйДокумент - ТабличныйДокумент
&После("ПередОтправкойПоПочте")
Процедура УБТ_ПередОтправкойПоПочте(ПараметрыОтправки, ПараметрыВывода, ОбъектыПечати, ПечатныеФормы) Экспорт
	
	ПараметрыОтправки.Вставить("УБТ_ВидЭлектронногоСообщения", ПараметрыВывода.УБТ_ВидЭлектронногоСообщения);
	
КонецПроцедуры

#КонецОбласти
