#Область ОбработчикиСобытий

Функция WebhookPOST(HTTPЗапрос)

	Бот = Справочники.TBM_БотыTelegram.НайтиБотаTelegramПоСекретномуЗаголовку(HTTPЗапрос.Заголовки.Получить(
		"X-Telegram-Bot-Api-Secret-Token"));

	ТелоЗапроса = HTTPЗапрос.ПолучитьТелоКакСтроку();
	Обновление = ОбщегоНазначения.JSONВЗначение(ТелоЗапроса, , Ложь);
	МассивОбновлений = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Обновление);

	ТаблицаСообщений = TBM_РаботаСБотамиTelegram.ПолученныеСообщенияВТаблицуЗначений(МассивОбновлений);
	TBM_РаботаСБотамиTelegram.ОтветитьНаПолученныеСообщения(Бот, ТаблицаСообщений);

	HTTPОтвет = Новый HTTPСервисОтвет(200);
	Возврат HTTPОтвет;

КонецФункции

#КонецОбласти