#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Конструктор параметров выполнения этапа.
// 
// Возвращаемое значение:
//  Структура - Новая структура параметров выполнения этапа:
// * НаименованиеТекущегоЭтапа - Строка 
// * ИдентификаторСообщения - Число
// * ТекстСообщения - Строка
// * ПроизвольныйКод - Строка
Функция НоваяСтруктураПараметровВыполненияЭтапа() Экспорт

	ПараметровВыполненияЭтапа = Новый Структура;
	ПараметровВыполненияЭтапа.Вставить("НаименованиеТекущегоЭтапа", "");
	ПараметровВыполненияЭтапа.Вставить("ИдентификаторСообщения", 0);
	ПараметровВыполненияЭтапа.Вставить("ТекстСообщения", "");
	ПараметровВыполненияЭтапа.Вставить("ПроизвольныйКод", "");

	Возврат ПараметровВыполненияЭтапа;

КонецФункции

#КонецОбласти

#КонецЕсли