#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Представление = СтрШаблон("%1 (%2)", Данные.Наименование, Данные.Код);

КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Поля.Добавить("Наименование");
	Поля.Добавить("Код");

КонецПроцедуры

#КонецОбласти

#КонецЕсли