#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс  
  
// Возвращает представление значения перечисления.
// 
// Параметры:
//  Статус - Строка - Статус
// 
// Возвращаемое значение:
//  Строка - строковое представление значения перечисления. 
Функция ПредставлениеПоЗначению(Статус) Экспорт

	Если Статус = Приватный Тогда
		Возврат "private";
	ИначеЕсли Статус = Группа Тогда
		Возврат "group";
	ИначеЕсли Статус = Супергруппа Тогда
		Возврат "supergroup";
	ИначеЕсли Статус = Канал Тогда
		Возврат "channel";
	Иначе
		Возврат "";
	КонецЕсли;

КонецФункции 

// Возвращает значение перчисления из представления.
// 
// Параметры:
//  Представление - Строка - представление статуса.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.УБТ_ТипыЧатовTelegram - значение перечисления. 
Функция ЗначениеИзПредставления(Представление) Экспорт

	Если Представление = "private" Тогда
		Возврат Приватный
	ИначеЕсли Представление = "group" Тогда
		Возврат Группа;
	ИначеЕсли Представление = "supergroup" Тогда
		Возврат Супергруппа;
	ИначеЕсли Представление = "channel" Тогда
		Возврат Канал;
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;

КонецФункции

#КонецОбласти

#КонецЕсли