#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создает или обновляет псевдо-предопределенный сценарий авторизации чатов.
Процедура ИнициализироватьСценарийАвторизации() Экспорт

	Если ЗначениеЗаполнено(СценарийАвторизацииЧатов()) Тогда
		Возврат;
	КонецЕсли;

	СценарийАвторизации = СоздатьЭлемент();

	СценарийАвторизации.Наименование = "Authorization";
	СценарийАвторизации.ТипСценария = Перечисления.TBM_ТипыСценариевБотовTelegram.Общение;

	ЭтапОтказа = СценарийАвторизации.Этапы.Добавить();
	ЭтапОтказа.НаименованиеЭтапа = "Отказ в доступе";
	ЭтапОтказа.УникальныйИдентификатор = Строка(Новый УникальныйИдентификатор);
	ЭтапОтказа.ПроизвольныйКод = "Результат.Ответ = ""Для продолжения необходимо авторизоваться. 
								 ||
								 ||Выберите один из вариантов авторизации: 
								 ||
								 || - OTP: введите одноразовый пароль, сгенерированный на стороне учетной системы 
								 ||
								 || - Номер телефона: отправьте свой номер телефона и дождитесь подтверждения со стороны администратора"";
								 |
								 |ЗавершитьЭтап(Параметры.НаименованиеТекущегоЭтапа);";

	КнопкаОтправитьНомерТелефона = СценарийАвторизации.КнопкиКлавиатуры.Добавить();
	КнопкаОтправитьНомерТелефона.Наименование = "Отправить номер телефона";
	КнопкаОтправитьНомерТелефона.УникальныйИдентификатор = ЭтапОтказа.УникальныйИдентификатор;
	КнопкаОтправитьНомерТелефона.ЗапросНомераТелефона = Истина;

	КнопкаОтправитьНомерТелефона = СценарийАвторизации.КнопкиКлавиатуры.Добавить();
	КнопкаОтправитьНомерТелефона.Наименование = "Ввести одноразовый код (OTP)";
	КнопкаОтправитьНомерТелефона.УникальныйИдентификатор = ЭтапОтказа.УникальныйИдентификатор;

	ЭтапПроверки = СценарийАвторизации.Этапы.Добавить();
	ЭтапПроверки.НаименованиеЭтапа = "Проверка OTP / Сохранение номера телефона";
	ЭтапПроверки.УникальныйИдентификатор = Строка(Новый УникальныйИдентификатор);
	ЭтапПроверки.ПроизвольныйКод = "Параметры.КнопкиКлавиатуры.Очистить();
								   |
								   |Если Параметры.ТекстСообщения = ""Ввести одноразовый код (OTP)"" Тогда
								   |
								   |Результат.Ответ = ""Введите одноразовый код (OTP)"";
								   |
								   |ЗавершитьЭтап(Параметры.НаименованиеТекущегоЭтапа);
								   |
								   |ИначеЕсли ЗначениеЗаполнено(Параметры.Контакт.НомерТелефона) Тогда
								   |
								   |ОбъектЧата = Чат.ПолучитьОбъект();
								   |ОбъектЧата.ИмяКонтакта = Параметры.Контакт.Имя;
								   |ОбъектЧата.НомерТелефона = Параметры.Контакт.НомерТелефона;
								   |ОбъектЧата.Записать();
								   |
								   |Результат.Ответ = ""Спасибо! Ваш запрос на авторизацию будет рассмотрен со стороны администратора."";
								   |
								   |ЗавершитьЭтап(Параметры.НаименованиеТекущегоЭтапа);
								   |ЗавершитьЭтап(""Ввод OTP"");
								   |
								   |Иначе
								   |
								   |КнопкаКлавиатуры = Справочники.TBM_ОбщенияБотовTelegramСЧатами.НоваяСтруктураКнопкаКлавиатуры();
								   |КнопкаКлавиатуры.Наименование = ""Отправить номер телефона"";
								   |КнопкаКлавиатуры.ЗапросНомераТелефона = Истина;
								   |Параметры.КнопкиКлавиатуры.Добавить(КнопкаКлавиатуры);
								   |
								   |КнопкаКлавиатуры = Справочники.TBM_ОбщенияБотовTelegramСЧатами.НоваяСтруктураКнопкаКлавиатуры();
								   |КнопкаКлавиатуры.Наименование = ""Ввести одноразовый код (OTP)"";
								   |Параметры.КнопкиКлавиатуры.Добавить(КнопкаКлавиатуры);
								   |
								   |Результат.Ответ = ""Пожалуйста, выебрите один из доступных вариантов авторизации."";
								   |
								   |КонецЕсли;";

	ЭтапВводаOTP = СценарийАвторизации.Этапы.Добавить();
	ЭтапВводаOTP.НаименованиеЭтапа = "Ввод OTP";
	ЭтапВводаOTP.УникальныйИдентификатор = Строка(Новый УникальныйИдентификатор);
	ЭтапВводаOTP.ПроизвольныйКод = "Если Параметры.ТекстСообщения = ""69"" Тогда
								   |
								   |Запись = РегистрыСведений.TBM_АвторизованныеСценарииЧатовTelegram.СоздатьМенеджерЗаписи();
								   |Запись.Бот = Бот;
								   |Запись.Чат = Чат;
								   |Запись.Сценарий = ЗапрошенныйСценарий;
								   |Запись.Записать();
								   |
								   |Результат.Ответ = ""Авторизация успешно завершена. Вы можете продолжить работу с ботом"";
								   |
								   |ЗавершитьЭтап(Параметры.НаименованиеТекущегоЭтапа);
								   |
								   |Иначе
								   |
								   |Результат.Ответ = ""Неверный код"";
								   |
								   |КонецЕсли;";

	СценарийАвторизации.Записать();

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция СценарийАвторизацииЧатов() Экспорт

	Возврат НайтиПоНаименованию("Authorization");

КонецФункции

#КонецОбласти

#КонецЕсли