#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;

	Если Ссылка = Справочники.УБТ_СценарииБотовTelegram.СценарийАвторизацииЧатов() Тогда
		ТекстОшибки = НСтр(
			"az = 'Çat avtorizasiya skriptinin redaktə edilməsi qadağandır.';en = 'Editing the chat authorization script is forbidden';ru = 'Запрещено редактирование сценария авторизации чатов.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , , Отказ);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли