#Область ПрограммныйИнтерфейс

// Выгружает сценарий Telegram бота в файл JSON.
// 
// Параметры:
//  Сценарий - СправочникСсылка.УБТ_СценарииБотовTelegram - Сценарий
Процедура ВыгрузитьСценарийБотаTelegramВФайл(Сценарий) Экспорт

	АдресФайлаВоВременномХранилище = УБТ_УправлениеБотамиTelegramСлужебныйВызовСервера.СохранитьJSONСхемуСценарияБотаTelegram(
		Сценарий);

	Если Не ПустаяСтрока(АдресФайлаВоВременномХранилище) Тогда

		ИмяФайла = Строка(Сценарий) + ".json";
		НачатьПолучениеФайлаССервера(АдресФайлаВоВременномХранилище, ИмяФайла);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти