
#Область ПрограммныйИнтерфейс

// Возвращает строку JSON из значения.
// 
// Параметры:
//  Значение - Структура, Массив Из Структура - Значение
// 
// Возвращаемое значение:
//  Строка - JSON
Функция JSONИзЗначения(Значение) Экспорт

	ЗаписьJSON = Новый ЗаписьJSON;	
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Значение,   );
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

// Возвращает значение из JSON строки.
// 
// Параметры:
//  JSON - Строка - JSON
//  ПрочитатьВСоответствие - Булево - Прочитать в соответствие
//  ИменаСвойствСоЗначениемДата - Строка - Имена свойств со значением дата
// 
// Возвращаемое значение:
//  Произвольный - значение, прочитанное из JSON
Функция ЗначениеИзJSON(JSON, ПрочитатьВСоответствие = Ложь, ИменаСвойствСоЗначениемДата = "") Экспорт

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(JSON);
	
	Возврат ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие, ИменаСвойствСоЗначениемДата);
	
КонецФункции 

#КонецОбласти
