#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Конструктор параметров выполнения этапа.
// 
// Возвращаемое значение:
//  Структура - Новая структура параметров выполнения этапа:
// * НаименованиеТекущегоЭтапа - Строка 
// * ИдентификаторТекущегоЭтапа - Строка
// * ИдентификаторСообщения - Число
// * ТекстСообщения - Строка
// * Контакт - См. НоваяСтруктураКонтакта
// * ПроизвольныйКод - Строка
// * КнопкиКлавиатуры - Массив Из Структура
Функция НоваяСтруктураПараметровВыполненияЭтапа() Экспорт

	ПараметровВыполненияЭтапа = Новый Структура;
	ПараметровВыполненияЭтапа.Вставить("НаименованиеТекущегоЭтапа", "");
	ПараметровВыполненияЭтапа.Вставить("ИдентификаторТекущегоЭтапа", "");
	ПараметровВыполненияЭтапа.Вставить("ИдентификаторСообщения", 0);
	ПараметровВыполненияЭтапа.Вставить("ТекстСообщения", "");
	ПараметровВыполненияЭтапа.Вставить("Контакт", НоваяСтруктураКонтакта());
	ПараметровВыполненияЭтапа.Вставить("ПроизвольныйКод", "");
	ПараметровВыполненияЭтапа.Вставить("КнопкиКлавиатуры", Новый Массив);

	Возврат ПараметровВыполненияЭтапа;

КонецФункции

Функция НоваяСтруктураКнопкаКлавиатуры() Экспорт

	КнопкаКлавиатуры = Новый Структура;
	КнопкаКлавиатуры.Вставить("Наименование", "");
	КнопкаКлавиатуры.Вставить("ЗапросНомераТелефона", Ложь);

	Возврат КнопкаКлавиатуры;

КонецФункции

Функция НоваяСтруктураКонтакта() Экспорт

	КнопкаКлавиатуры = Новый Структура;
	КнопкаКлавиатуры.Вставить("Имя", "");
	КнопкаКлавиатуры.Вставить("НомерТелефона", "");

	Возврат КнопкаКлавиатуры;

КонецФункции

#КонецОбласти

#КонецЕсли