	 
#Область ОбработчикиСобытийФормы
	 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьЭлементовПоТипуДействия();
	
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипДействияПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовПоТипуДействия();
	
КонецПроцедуры  

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Процедура УстановитьВидимостьЭлементовПоТипуДействия()

	Элементы.Страницы.Видимость = ЗначениеЗаполнено(Объект.ТипСценария);
	
	Если Не Элементы.Страницы.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ТипСценария = Перечисления.TBM_ТипыСценариевБотовTelegram.ОтправкаОтчета Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОтчеты;     
	ИначеЕсли Объект.ТипСценария = Перечисления.TBM_ТипыСценариевБотовTelegram.Общение Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОбщение;
	ИначеЕсли Объект.ТипСценария = Перечисления.TBM_ТипыСценариевБотовTelegram.ПроизвольныйСценарий Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПроизвольныйКод; 
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

