
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает GUID бота с префиксом расширения. Используется для совместимости с конфигурациями и платформами нижних версий.
// 
// Параметры:
//  Бот - СправочникСсылка.TBM_БотыTelegram - Бот
// 
// Возвращаемое значение:
//  Строка - Идентификатор элемента бота с префиксом
Функция ИдентификаторЭлементаБотаСПрефиксом(Бот) Экспорт

	Возврат "TBM_Бот_" + Строка(Бот.УникальныйИдентификатор())

КонецФункции

#КонецОбласти

#КонецЕсли