#Область ОбработчикиСобытийФормы

&НаСервере
Процедура УБТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("УБТ_ВидЭлектронногоСообщения", Объект.УБТ_ВидЭлектронногоСообщения);

	Если Не ЗначениеЗаполнено(Объект.УБТ_ВидЭлектронногоСообщения) Тогда
		Объект.УБТ_ВидЭлектронногоСообщения = Перечисления.УБТ_ВидыЭлектронныхСообщений.ЭлектронноеПисьмо;
	КонецЕсли;

	УБТ_РазместитьЭлементыTelegramНаФорме();
	УБТ_УстановитьВидимостьЭлементовПоВидуСообщения();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РазмещенииЭлементов

&НаСервере
Процедура УБТ_РазместитьЭлементыTelegramНаФорме()

	УБТ_РазместитьПереключательВидаСообщения();
	УБТ_РазместитьРеквизитБотаTelegram();
	УБТ_РазместитьТаблицуЧатовTelegram();

КонецПроцедуры

&НаСервере
Процедура УБТ_РазместитьПереключательВидаСообщения()

	ЭлементВидЭлектронногоСообщения = Элементы.Вставить("УБТ_ВидЭлектронногоСообщения", Тип("ПолеФормы"),
		Элементы.ГруппаЛево, Элементы.СписокПолучателей);
	ЭлементВидЭлектронногоСообщения.ПутьКДанным = "Объект.УБТ_ВидЭлектронногоСообщения";
	ЭлементВидЭлектронногоСообщения.Вид = ВидПоляФормы.ПолеПереключателя;
	ЭлементВидЭлектронногоСообщения.ВидПереключателя = ВидПереключателя.Тумблер;

	Для Каждого ЗначениеПеречисления Из Метаданные.Перечисления.УБТ_ВидыЭлектронныхСообщений.ЗначенияПеречисления Цикл
		ЭлементВидЭлектронногоСообщения.СписокВыбора.Добавить(
			Перечисления.УБТ_ВидыЭлектронныхСообщений[ЗначениеПеречисления.Имя], ЗначениеПеречисления.Синоним);
	КонецЦикла;

	ЭлементВидЭлектронногоСообщения.УстановитьДействие("ПриИзменении", "УБТ_ВидЭлектронногоСообщенияПриИзменении");

КонецПроцедуры

&НаСервере
Процедура УБТ_РазместитьРеквизитБотаTelegram()

	ЭлементБотTelegram = Элементы.Вставить("УБТ_БотTelegram", Тип("ПолеФормы"), Элементы.ГруппаЛево,
		Элементы.СписокПолучателей);
	ЭлементБотTelegram.ПутьКДанным = "Объект.УБТ_БотTelegram";
	ЭлементБотTelegram.Вид = ВидПоляФормы.ПолеВвода;

КонецПроцедуры

&НаСервере
Процедура УБТ_РазместитьТаблицуЧатовTelegram()

	ЭлементЧатыПолучатели = Элементы.Вставить("УБТ_ЧатыПолучатели", Тип("ТаблицаФормы"), Элементы.ГруппаЛево,
		Элементы.СписокПолучателей);
	ЭлементЧатыПолучатели.ПутьКДанным = "Объект.УБТ_ЧатыПолучатели";

	КолонкаТаблицы = Элементы.Добавить("УБТ_ЧатыПолучателиЧат", Тип("ПолеФормы"), ЭлементЧатыПолучатели);
	КолонкаТаблицы.Вид = ВидПоляФормы.ПолеВвода;
	КолонкаТаблицы.ПутьКДанным = "Объект.УБТ_ЧатыПолучатели.Чат";

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

&НаКлиенте
Процедура УБТ_ВидЭлектронногоСообщенияПриИзменении(Элемент)
	
	УБТ_УстановитьВидимостьЭлементовПоВидуСообщения();
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере
Процедура УБТ_УстановитьВидимостьЭлементовПоВидуСообщения()

	Если Объект.УБТ_ВидЭлектронногоСообщения = Перечисления.УБТ_ВидыЭлектронныхСообщений.Telegram Тогда
		Элементы.УБТ_ЧатыПолучатели.Видимость = Истина;
		Элементы.УБТ_БотTelegram.Видимость = Истина;
		Элементы.СписокПолучателей.Видимость = Ложь;
	Иначе
		Элементы.УБТ_ЧатыПолучатели.Видимость = Ложь;
		Элементы.УБТ_БотTelegram.Видимость = Ложь;
		Элементы.СписокПолучателей.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти